class DistrictCorrector:
    CORRECTIONS = {
        "ленінськиий": "Ленінський",
        "дніропетровський": "Дніпропетровський",
        "криворізькій": "Криворізький",
        "всилівський": "Василівський",
        "антрацитвський": "Антрацитівський",
        "лутугинськй": "Лутугинський",
        "перевалський": "Перевальський",
        "ткрківський": "Турківський",
        "яворівськитй": "Яворівський",
        "новоодеська": "Новоодеський",
        "володиимрецький": "Володимирецький",
        "векликописарівський": "Великописарівський",
        "контопський": "Конотопський",
        "середино-буський": "Середино-Будський",
        "чугуїівський": "Чугуївський",
        "віньньковецький": "Віньковецький",
        "заставнівськи": "Заставнівський",
        "кельменцький": "Кельменецький",
        "кельменцький": "Кельменецький",
        "сокирянький": "Сокирянський",
    }

    @classmethod
    def correct(cls, name):
        name = name.replace("ск", "ськ").replace("кого", "кий").replace("іськ", "івськ")
        low = name.lower()
        if low in cls.CORRECTIONS:
            name = cls.CORRECTIONS[low]
        return name
